app/controllers/api/v1/cars_controller.rb

      def create
        @car = Car.new(car_params)
        @car_type = CarsType.find (params[:car][:cars_type_id])
        @car.cars_type = @car_type
        if @car.valid? && @car.save
---
SELECT  "cars_types".* FROM "cars_types" WHERE "cars_types"."id" = ? LIMIT ?  [["id", "974a83bf-84a6-4355-a912-18d3de6ea48c"], ["LIMIT", 1]]
INSERT INTO "cars" ("id", "name", "horsepower", "price", "cars_type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

      def update
        if @car.update(car_params)
---
UPDATE "cars" SET "name" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["name", "Kia Ceratooo"], ["updated_at", "2018-02-28 22:37:48.446454"], ["id", "d115ee2f-9c59-4e8a-a801-5e055d9f050d"]]

      def destroy
        if @car.destroy
---
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", "d115ee2f-9c59-4e8a-a801-5e055d9f050d"]]