app/controllers/api/v1/cars_types_controller.rb

INSERT INTO "cars_types" ("id", "car_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", "7d0a08ee-95b0-4061-ad45-8eec4861d461"], ["car_type", "VAN"], ["created_at", "2018-02-28 21:53:26.328172"], ["updated_at", "2018-02-28 21:53:26.328172"]]
---
      def create
        @cars_type = CarsType.new(cars_type_params)
        if @cars_type.valid? && @cars_type.save

UPDATE "cars_types" SET "car_type" = ?, "updated_at" = ? WHERE "cars_types"."id" = ?  [["car_type", "VAN1"], ["updated_at", "2018-02-28 21:58:09.037395"], ["id", "7d0a08ee-95b0-4061-ad45-8eec4861d461"]]
---
      def update
        if @cars_type.update(cars_type_params)

DELETE FROM "cars_types" WHERE "cars_types"."id" = ?  [["id", "7d0a08ee-95b0-4061-ad45-8eec4861d461"]]
---
      def destroy
        if @cars_type.destroy

SELECT  "cars_types".* FROM "cars_types" WHERE "cars_types"."id" = ? LIMIT ?  [["id", "974a83bf-84a6-4355-a912-18d3de6ea48c"], ["LIMIT", 1]]
---
      def set_cars_type
        @cars_type = CarsType.find(params[:id])